import Link from 'next/link';
import { blogCard } from '@/lib/interface';


// import { Card, CardBody, CardFooter, CardHeader } from '@nextui-org/card';
import Image from 'next/image';
import { Button } from '@nextui-org/button';
import { Card, CardBody, CardFooter, CardHeader } from '@nextui-org/card';
import PostCatMenu from '@/components/PostCatMenu';
import { getMotornoMasloPosts } from '@/lib/service';

const BlogPage = async () => {
	const posts: blogCard[] = await getMotornoMasloPosts();

	// console.log("Posts")
	// console.log(posts)

	return (
        // <p>Loading</p>
		<div className="blog-page">
            <PostCatMenu />
            <h1>Моторно масло</h1>
			<div className="posts">
				{posts.map((post: any, idx: number) => {
                    // console.log("Post")
                    // console.log(post)
					return (
						<Card className='mb-[20px]' key={idx}>
                            <Image 
                                src={post.featuredImage.node.sourceUrl} 
                                alt="image" 
                                width={600} 
                                height={400}
                                className='rounded-t-lg object-cover'
                            />
                            <CardHeader className='py-[5px] my-[5px] blog-card-head'>
                                <h2 className='blog-post-title text-center text-lg line-clamp-2'>{post.title}</h2>
                            </CardHeader>
                            <CardBody className='p-[5px]'>
                                <p className='line-clamp-2 text-sm'>{post.shortDesc}</p>
                            </CardBody>
                            <CardFooter>
                                <Button className='w-full mt7'>
                                    <Link href={`${post.slug}`}>Виж</Link>
                                </Button>
                            </CardFooter>
                        </Card>
					);
				})}
			</div>
            <p>Автомобилът в наши дни се е превърнал в най-добрия приятел на човека – наш неоценим помощник, без когото не можем. За да ни служи вярно обаче и ние трябва да се погрижим за него.</p>
            <p>От изключително значение за добрата работа и състояние на автомобила е смяната на моторното масло. Това е основен фактор за перфектна работа на автомобилния двигател.</p>
            <p>Моторното масло смазва движещите се части от двигателя. Благодарение на него се намалява разхода на гориво и вътрешното триене. Защитава двигателя от образуване на отлагания и утайки. Предпазво го от корозия и подпомага стартирането му. Има и още редица функции.</p>
            <p>Не всеки обаче знае какво масло е подходящо за неговия автомобил. Чува за различни видове, но няма представа каква е разликата между тях.</p>
            <p>Маслата се разделят на три основни вида: синтетични, полусинтетични и минерални.</p>
            <ul>
                <li>Синтетичните масла се получавават чрез изцяло контролирани химически процеси. То е с високо качество, чисто е и производителите го препоръчват.</li>
                <li>Полусинтетичните масла представляват смес между другите два вида и са едно средното решение, балансирано между качество и цена.</li>
                <li>Минералните масла се добиват чрез дестилация на нефт, без никакви допълнителни обработки. Качествата му не са високи.</li>
            </ul>
            <p>Определящо при моторното масло е вискозитетът му. Той се определя според класификацията на SAE и според нея маслата са поделени на зимни, летни и всесезонн.</p>
            <p>Изборът на масло най-често се определя според производителя на автомобилния двигател.</p>
            <p>Не всеки обаче знае какво масло е подходящо за неговия автомобил. Чува за различни видове, но няма представа каква е разликата между тях.</p>
            <p>Маслата се разделят на три основни вида: синтетични, полусинтетични и минерални.</p>
            <p>Синтетичните масла се получавават чрез изцяло контролирани химически процеси. То е с високо качество, чисто е и производителите го препоръчват.</p>
            <p>Полусинтетичните масла представляват смес между другите два вида и са едно средното решение, балансирано между качество и цена.</p>
            <p>Минералните масла се добиват чрез дестилация на нефт, без никакви допълнителни обработки. Качествата му не са високи.</p>
            <p>Определящо при моторното масло е вискозитетът му. Той се определя според класификацията на SAE и според нея маслата са поделени на зимни, летни и всесезонни.</p>
            <p>Изборът на масло най-често се определя според производителя на автомобилния двигател.</p>
		</div>
	);
};

export default BlogPage;